yingshaoxo/super_led_fan/MSP430F169/main.c
    delay_for_leds(44);

    for (i = 0; i < 16; i++) {
        set_first_8_red_leds(0xff);
        set_second_8_red_leds(0xff);
        delay_for_leds(value);
        set_first_8_green_leds(0x00);
        set_second_8_green_leds(0x00);
        delay_for_leds(value);

        delay_for_leds(3);
        turn_off_all_leds();
        delay_for_leds(3);
    }
}

// ****************

// Task 5

// ****************

void task5() {
}

// ****************

// Task 6

// ****************

unsigned char point_square[96];
unsigned char Idex = 0;
unsigned int dnum;
int show_task6 = 0;
void task6() {
    if (show_task6 == 1) {
        unsigned char i, index = 0;

        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(0x00);
            set_second_8_green_leds(0x00);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 32;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(0x00);
            set_second_8_green_leds(0x00);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 64;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(0x00);
            set_second_8_green_leds(0x00);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
    }
}

// ****************

// Task 7

// ****************

void task7() {
    unsigned char i, index = 0;

    if (infrared_detection_counting3 < 150) {
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(0x00);
            delay_for_leds(3);
            set_first_8_green_leds(0x00);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 32;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(0x00);
            delay_for_leds(3);
            set_first_8_green_leds(0x00);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 64;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(0x00);
            delay_for_leds(3);
            set_first_8_green_leds(0x00);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
    } else if ((infrared_detection_counting3 > 149) && (infrared_detection_counting3 < 300)) {
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(0x00);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 32;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(0x00);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 64;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(0x00);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
    } else if ((infrared_detection_counting3 > 299) && (infrared_detection_counting3 < 450)) {
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(0x00);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 32;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(0x00);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 64;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(0x00);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
    } else if ((infrared_detection_counting3 > 449) && (infrared_detection_counting3 < 600)) {
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(0x00);
            set_second_8_green_leds(0x00);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 32;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(0x00);
            set_second_8_red_leds(0x00);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 64;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
    } else if ((infrared_detection_counting3 > 599) && (infrared_detection_counting3 < 750)) {
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(0x00);
            set_second_8_red_leds(0x00);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 32;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(0x00);
            set_second_8_red_leds(0x00);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 64;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(0x00);
            set_second_8_red_leds(0x00);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
    } else if ((infrared_detection_counting3 > 749) && (infrared_detection_counting3 < 900)) {
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(0x00);
            set_second_8_green_leds(0x00);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 32;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(0x00);
            set_second_8_green_leds(0x00);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 64;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(0x00);
            set_second_8_green_leds(0x00);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
    } else if ((infrared_detection_counting3 > 899) && (infrared_detection_counting3 < 1050)) {
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 32;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
        delay_for_leds(44);

        index = 64;
        for (i = 0; i < 16; i++) {
            set_first_8_red_leds(point_square[index]);
            set_second_8_red_leds(point_square[index + 16]);
            delay_for_leds(3);
            set_first_8_green_leds(point_square[index]);
            set_second_8_green_leds(point_square[index + 16]);
            delay_for_leds(2);

            delay_for_leds(3);
            turn_off_all_leds();
            delay_for_leds(3);

            index++;
        }
    }
}

// ****************

// Other Task

// ****************

