yingshaoxo/super_led_fan/MSP430F169/main.c
void show_camera() {
}

// ***************
// ****************
//
// Handle keypad value !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//
// ***************
// ****************

/* 
1	2	3	Return(or back)
4	5	6	Menu
7	8	9	Cancel
    0	.	Enter

.: 10
Return: 11
Menu: 12
Cancel: 13
Enter: 14
*/

void clean_LCD_menu() {
    screen_clean();
    millisecond_of_delay(60);
}

char input_string[50];

int task_number_from_keypad = 0;

int state = -1;
int parameter1 = -1;
int parameter2 = -1;
int parameter3 = -1;
void handle_keypad_key(int number) {
    if (number != 10) {
        if (number < 10) {
            clean_LCD_menu();

            char text[1];
            int_to_string(number, text, 1);
            strcat(input_string, text);
            print_string(0, 1, input_string);
        } else if (number == 14 || number == 15) {
            if (strcmp(input_string, "") == 0) {
                state = -1;
                strcpy(input_string, "");
                parameter1 = -1;
                parameter2 = -1;
                parameter3 = -1;

                clean_LCD_menu();
                print_string(0, 1, "Which Task?");
                return;
            }
            state += 1;
            if (state == 0) {
                int target_number = atoi(input_string);
                task_number_from_keypad = target_number;
                strcpy(input_string, "");

                clean_LCD_menu();
                print_string(0, 1, "Parameter1?");
            } else if (state == 1) {
                int target_number = atoi(input_string);
                parameter1 = target_number;
                strcpy(input_string, "");

                clean_LCD_menu();
                print_string(0, 1, "Parameter2?");
            } else if (state == 2) {
                int target_number = atoi(input_string);
                parameter2 = target_number;
                strcpy(input_string, "");

                clean_LCD_menu();
                print_string(0, 1, "Parameter3?");
            } else if (state == 3) {
                int target_number = atoi(input_string);
                parameter3 = target_number;
                strcpy(input_string, "");

                clean_LCD_menu();
                print_string(0, 1, "Back to menu?");
            } else {
                state = -1;
                strcpy(input_string, "");
                parameter1 = -1;
                parameter2 = -1;
                parameter3 = -1;

                clean_LCD_menu();
                print_string(0, 1, "Which Task?");
                return;
            }
        } else if (number == 11 || number == 12 || number == 13) {
            state = -1;
            strcpy(input_string, "");
            parameter1 = -1;
            parameter2 = -1;
            parameter3 = -1;

            clean_LCD_menu();
            print_string(0, 1, "Which Task?");
            return;
        }
    }

    // handle all tasks here
    print_number(0, 2, task_number_from_keypad);
    if (parameter1 != -1) {
        print_number(0, 3, parameter1);
    }
    if (parameter2 != -1) {
        print_number(0, 4, parameter2);

        if (parameter3 != -1) {
            char text[20];
            sprintf(text, "%d       %d", parameter2, parameter3);
            print_string(0, 4, text);
        }
    }

    if (task_number_from_keypad == 5) {
        if (parameter3 != -1) {
            if (an_image_received == 1) {
                clean_LCD_menu();
                draw_picture_from_serial();
                an_image_received = 0;
            }
        } else if (parameter2 != -1) {
            if (an_image_received == 1) {
                clean_LCD_menu();
                draw_picture_from_serial();
                an_image_received = 0;
            }
        } else if (parameter1 != -1) {
            if (an_image_received == 1) {
                clean_LCD_menu();
                draw_picture_from_serial();
                an_image_received = 0;
            }
        }
    }

    if (task_number_from_keypad == 6) {
        if (parameter3 != -1) {
            if (an_image_received == 1) {
                for (dnum = 0; dnum < 256; dnum++) {
                    if (dnum < 128) {
                        Idex = 0 + 32 * 2;
                    } else {
                        Idex = 16 + 32 * 2;
                    }
                    if (an_image[dnum] == 1) {
                        point_square[Idex + dnum % 16] |= (0x80 >> ((dnum / 16) % 8));
                    } else {
                        point_square[Idex + dnum % 16] &= ~(0x80 >> ((dnum / 16) % 8));
                    }
                }
                show_task6 = 1;
                an_image_received = 0;
            }
        } else if (parameter2 != -1) {
            if (an_image_received == 1) {
                for (dnum = 0; dnum < 256; dnum++) {
                    if (dnum < 128) {
                        Idex = 0 + 32 * 1;
                    } else {
                        Idex = 16 + 32 * 1;
                    }
                    if (an_image[dnum] == 1) {
                        point_square[Idex + dnum % 16] |= (0x80 >> ((dnum / 16) % 8));
                    } else {
                        point_square[Idex + dnum % 16] &= ~(0x80 >> ((dnum / 16) % 8));
                    }
                }
                an_image_received = 0;
            }
        } else if (parameter1 != -1) {
            if (an_image_received == 1) {
                for (dnum = 0; dnum < 256; dnum++) {
                    if (dnum < 128) {
                        Idex = 0 + 32 * 0;
                    } else {
                        Idex = 16 + 32 * 0;
                    }
                    if (an_image[dnum] == 1) {
                        point_square[Idex + dnum % 16] |= (0x80 >> ((dnum / 16) % 8));
                    } else {
                        point_square[Idex + dnum % 16] &= ~(0x80 >> ((dnum / 16) % 8));
                    }
                }
                an_image_received = 0;
            }
        }
    }

