yingshaoxo/super_led_fan/MSP430F169/main.c
    if (task_number_from_keypad == 8) {
        if (an_image_received == 1) {
            clean_LCD_menu();
            draw_picture_from_serial();
            an_image_received = 0;
        }
    }
}

#pragma vector = USART0RX_VECTOR
__interrupt void usart0_rx(void) {
    while (!(IFG1 & UTXIFG0)) {
        // USART0 TX buffer ready?
    }
    STATE_FROM_SERIAL = (int)RXBUF0; // receive state
    //TXBUF0 = (unsigned char)STATE_YOU_WANT_TO_SEND; // send state

    if (STATE_FROM_SERIAL != 0 || data_arraving == 1) {
        if (data_arraving == 0) {
            TASK_NUMBER = STATE_FROM_SERIAL;
            if (TASK_NUMBER == 8) {
                an_image_received = 0;
            }
            data_arraving = 1;

        } else {
            if (TASK_NUMBER == 8) {     // handle image data
                if (data_index < 256) { // data_index = 255, actually the 256 element
                    if (STATE_FROM_SERIAL == 9) {
                        an_image[data_index] = 1;
                    } else {
                        an_image[data_index] = 0;
                    }
                } else { // data_index == 256, actually the 257 element
                    image_index = STATE_FROM_SERIAL;
                }
            }
            if (TASK_NUMBER == 11) { // handle keypad data
                if (data_index == 0) {
                    KeyPad_value = STATE_FROM_SERIAL;
                }
                if (data_index == 1) {
                    new_KeyPad_state = STATE_FROM_SERIAL;
                }
            }

            data_index += 1;

            if (data_index > 256) {
                data_arraving = 0;
                data_index = 0;
                if (TASK_NUMBER == 8) { // handle image data after data transmission finished
                    an_image_received = 1;
                }
                if (TASK_NUMBER == 11) { // handle keypad data after data transmission finished
                    if (old_KeyPad_state != new_KeyPad_state) {
                        // do something
                        handle_keypad_key(KeyPad_value);
                    }
                    old_KeyPad_state = new_KeyPad_state;
                }
            }
        }
    } else {
        TASK_NUMBER = 0;
    }
}

int main(void) {
    WDTCTL = WDTPW | WDTHOLD; // stop watchdog timer

    initialize_LCD();
    initialize_serial_communication();
    initialize_infrared_sensor();
    initialize_16_rows_LED();

    print_string(0, 1, "Which Task?");

    while (1) {
        if (enter_pin_interrupt == 1) {
            switch (task_number_from_keypad) {
            case 0:
                break;
            case 1:
                if (parameter1 != -1 && parameter2 != -1) {
                    task1(parameter1, parameter2);
                }
                break;
            case 2:
                task2();
                break;
            case 3:
                task3();
                break;
            case 4:
                task4();
                break;
            case 5:
                task5();
                break;
            case 6:
                task6();
                break;
            case 7:
                task7();
                break;
            case 8:
                show_camera();
                break;
            default:
                break;
            }
            enter_pin_interrupt = 0;
        }
    }
}
